app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
    def index
      respond_to do |format|
        format.html do
          @pagy, @users = pagy User.order(created_at: :desc)

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
    def respond_with_zipped_users
      compressed_filestream = Zip::OutputStream.write_buffer do |zos|
        User.order(created_at: :desc).each do |user|