app/controllers/answers_controller.rb

UPDATE "answers" SET "body" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["body", "Updated"], ["updated_at", "2022-06-28 16:18:52.512561"], ["id", 8]]
---
  def update
    if @answer.update answer_update_params

INSERT INTO "answers" ("body", "question_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Lorem ipsum dolor sit amet, consectetur adipiscing elit"], ["question_id", 42], ["created_at", "2022-07-17 11:09:04.660189"], ["updated_at", "2022-07-17 11:09:04.660189"], ["user_id", 3]]
---
  def create
    @answer = @question.answers.build answer_create_params

    if @answer.save

DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 14]]
---
  def destroy
    @answer.destroy

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]
---
  def set_question!
    @question = Question.find params[:question_id]

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ? AND "answers"."id" = ? LIMIT ?  [["question_id", 42], ["id", 15], ["LIMIT", 1]]
---
  def set_answer!
    @answer = @question.answers.find params[:id]