app/controllers/questions_controller.rb

  def destroy
    @question.destroy
---
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 35]]

  def update
    if @question.update question_params
---
UPDATE "questions" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["title", "1233"], ["body", "Lorem ipsum dolor sit amet, consectetur adi111piscing elit"], ["updated_at", "2022-06-26 12:01:31.478041"], ["id", 3]]

  def index
    @pagy, @questions = pagy Question.order(created_at: :desc)
---
SELECT "questions".* FROM "questions" ORDER BY "questions"."created_at" DESC

  def create
    @question = current_user.questions.build question_params
    if @question.save
---
INSERT INTO "questions" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)

  def set_question!
    @question = Question.find params[:id]
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]