app/controllers/sessions_controller.rb

  def set_user
    @user = User.find_by email: params[:email]
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]