app/controllers/users_controller.rb

  def update
    if @user.update user_params
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2022-07-03 13:29:56.815405"], ["id", 2]]

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("email", "name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "test@test.com"], ["name", "test"], ["password_digest", "[FILTERED]"], ["created_at", "2022-06-30 09:26:18.797522"], ["updated_at", "2022-06-30 09:26:18.797522"]]

  def set_user!
    @user = User.find params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]