app/controllers/concerns/authentication.rb

    def user_from_session
      User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def user_from_token
      user = User.find_by(id: cookies.encrypted[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]